Econ_Practice_Questions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Practice Questions</title>
<!-- 2017-08-19 Sat 19:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Anghelo De La Cruz" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="content">
<h1 class="title">Practice Questions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. A</a>
<ul>
<li><a href="#sec-1-1">1.1. Explain how the RBA uses open market operations to increase interest rates.</a></li>
<li><a href="#sec-1-2">1.2. Evaulate the efficitiveness of monetary policy in achieving domestic economic stabililty over the last three years.</a></li>
<li><a href="#sec-1-3">1.3. Consider the following information</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Describe the policy stane adopted by the government in relation to budgetary policy for the period identified above.</a></li>
<li><a href="#sec-1-3-2">1.3.2. Explain the difference in the stance adopted by the Reserve Bank in setting monetary policy.</a></li>
<li><a href="#sec-1-3-3">1.3.3. Monetary and budgetary policies are often referred to as 'demand management poicies'. Explain this means.</a></li>
<li><a href="#sec-1-3-4">1.3.4. Explain the effect of the monetary Policy stance on inflation and material living standards.</a></li>
<li><a href="#sec-1-3-5">1.3.5. Explain how budgetary policy may be used to overcome a slowing economy and how this may negatively impact upon external stability.</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Consider the following</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Define the economic goal of strong and sustainable economic growth</a></li>
<li><a href="#sec-1-4-2">1.4.2. What is the likely effect of <b>each</b> of the following factors on economic growth?</a></li>
<li><a href="#sec-1-4-3">1.4.3. Assuming the predictions in the Reserve Bank of Australia's statement prove to be correct, discuss the monetary policy setting (stance) likely to be taken by the RBA over the next two years.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Explain how the RBA uses open market operations to increase interest rates.</h3>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Evaulate the efficitiveness of monetary policy in achieving domestic economic stabililty over the last three years.</h3>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Consider the following information</h3>
<div class="outline-text-3" id="text-1-3">
<blockquote>
<ul class="org-ul">
<li>Throughout 2011 [January to November], the Reserve Bank of
Australia held the cash rate steady at 4.75%
</li>
<li>In 2009-10 the budget outcome was a deficit of $52.9b. The deficit
in 2010-11 was predicted to be $40.8b with the government planning
to move the budgget to a surplus in 2012-13.
</li>
</ul>
</blockquote>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Describe the policy stane adopted by the government in relation to budgetary policy for the period identified above.</h4>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Explain the difference in the stance adopted by the Reserve Bank in setting monetary policy.</h4>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Monetary and budgetary policies are often referred to as 'demand management poicies'. Explain this means.</h4>
</div>
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Explain the effect of the monetary Policy stance on inflation and material living standards.</h4>
</div>
<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> Explain how budgetary policy may be used to overcome a slowing economy and how this may negatively impact upon external stability.</h4>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Consider the following</h3>
<div class="outline-text-3" id="text-1-4">
<blockquote>
<p>
'Looking ahead, the Bank expect unemployment to rise
further before it peaks. Over time, growth is expected to strengthen,
helped by continued low interest rates and the lower exchange
rate. Inflation is expected to be consistent with the 2-3 per cent
target over the next two years.'  
</p>
</blockquote>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Define the economic goal of strong and sustainable economic growth</h4>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> What is the likely effect of <b>each</b> of the following factors on economic growth?</h4>
<div class="outline-text-4" id="text-1-4-2">
</div><ol class="org-ol"><li><a id="sec-1-4-2-1" name="sec-1-4-2-1"></a>continued low interest rates<br  /></li>

<li><a id="sec-1-4-2-2" name="sec-1-4-2-2"></a>the lower exchange rate<br  /></li></ol>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Assuming the predictions in the Reserve Bank of Australia's statement prove to be correct, discuss the monetary policy setting (stance) likely to be taken by the RBA over the next two years.</h4>
</div>
</div>
</div>
</div>
</body>
</html>
